/*

- 객체 지향 프로그래밍은 무엇인가?
    코드를 작성하고 구조화 하는 방법이며
    코드에 대해 생각하고 계획하는 방법이기도 하다
    코드 내에서 실생활 개체로 작업을 진행하는 것.
    즉 온라인 상점을 구축한다고 가정했을 시
    상품 목록에 관련된 것을 객체화하여
    상뭄 목록에 관련된 데이터와 메서드 및 논리 코드를 한 클래스에 넣어 객체화하여 사용할 수 있게 계획하는 것이다.
    그리고 또 다른 상품 객체를 생성하여 두 객체를 연결하여 사용할 수도 있다.

- javascript에서 OOP는?
    객체 리터럴 표기법 -> app.js 참고

- classes & instances
    클래스 - 객체를 위한 청사진을 정의할 수 있기 해줌
    인스턴스 - 클래스를 실 사용하기 위해 객체화 시킨 것

    빠르게 데이터를 묶는데는 객체 리터럴 표기가 더 빠를수 있다
    하지만 재사용성을 높이고 싶을때는 클래스로 구성하자.

- Properties, Fields & Methods

- inheritance (상속)


*/